
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/Akihiro1001/aws-ecs-terraform/actions/runs/4997924137)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0320ac62caeaa7389]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0f0dd577b6a580cb7]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-056fe42137121ab23]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d213fca1fe5e63ac]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0863081fb8ee5dc4b]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-053e7113956f941a5]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0055e2096efcdf432]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0239dae77dd06e08b]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0ee05e5fe37c19eb6]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b7620782af7fcfdc]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-04b35dbc37682e7c6]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-05f8d8de411c15369]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-03f34da35d1513cc6]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0777319f9135b1951]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-079b4d08769220b42]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-01404b9acf6c213fc]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0aa82e323ed8a1986]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0a7f35f189649afbf]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0fcd1681f1faef93a]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-03ab0044aef7d9e99]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0777319f9135b19511080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0ee05e5fe37c19eb61080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-04b35dbc37682e7c61080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "For ALB."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from ALL."
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "go-simple-server-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-alb"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-alb"
        }
      + vpc_id                 = "vpc-0320ac62caeaa7389"
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "For ECS."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "go-simple-server-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-ecs"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-ecs"
        }
      + vpc_id                 = "vpc-0320ac62caeaa7389"
    }

  # aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow 8080 from Security Group for ALB."
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_security_group.ecs: Creating...
aws_security_group.alb: Creating...
aws_security_group.ecs: Creation complete after 5s [id=sg-0d9c9b456395c778a]
aws_security_group.alb: Creation complete after 5s [id=sg-0d1fb1e79c58dc2bc]
aws_security_group_rule.ecs_from_alb: Creating...
aws_security_group_rule.ecs_from_alb: Creation complete after 1s [id=sgrule-3601755104]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":3,"Program":"tfcmt","SHA1":"4e4c79e52aa9f1ba98fc23c05e519baea75209f1","Vars":{},"WorkflowName":"Terraform"} -->